# Задание 1 "Символическая выжимка"
s = input("Введите строку: ")
unique = set(s)
print("Уникальные символы:", ''.join(unique))
